# Lab 2 - Exploratory Data Analysis

In [1]:
import pandas as pd

## 1. Import Data

In [2]:
df = pd.read_csv('imdb-videogames.csv')

## 2. Inspect a Portion of the Dataset

Use head() to see the first five items in the file.

In [3]:
df.head()

,Unnamed: 0,name,url,year,certificate,rating,votes,plot summary,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
0,0,Spider-Man,https://www.imdb.com/title/tt5807780/?ref_=adv...,2018.0,T,9.2,"20,759","When a new villain threatens New York City, Pe...",True,True,False,False,False,True,False,False,False
1,1,Red Dead Redemption II,https://www.imdb.com/title/tt6161168/?ref_=adv...,2018.0,M,9.7,"35,703",Amidst the decline of the Wild West at the tur...,True,True,False,True,False,False,False,False,False
2,2,Grand Theft Auto V,https://www.imdb.com/title/tt2103188/?ref_=adv...,2013.0,M,9.5,"59,986",Three very different criminals team up for a s...,True,False,False,True,False,False,False,False,False
3,3,God of War,https://www.imdb.com/title/tt5838588/?ref_=adv...,2018.0,M,9.6,"26,118","After wiping out the gods of Mount Olympus, Kr...",True,True,False,False,False,False,False,False,False
4,4,Uncharted 4: A Thief's End,https://www.imdb.com/title/tt3334704/?ref_=adv...,2016.0,T,9.5,"28,722",Thrown back into the dangerous underworld he'd...,True,True,False,False,False,False,False,False,False

Use tail() to get the last five values.
You can also place a number in the parenthesis to get however many values that you want. Same goes for head().

In [14]:
df.tail()

,Unnamed: 0,name,url,year,certificate,rating,votes,plot summary,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
20800,20798,"Enjoy Your Power, Enjoy Your Choice",https://www.imdb.com/title/tt3845606/?ref_=adv...,2014.0,NaN,NaN,NaN,Add a Plot,False,False,False,False,False,False,False,False,True
20801,20799,RedSun2020,https://www.imdb.com/title/tt0790739/?ref_=adv...,2004.0,NaN,NaN,NaN,Joseph gets kidnapped and it's the player's jo...,False,False,False,False,False,False,False,False,True
20802,20800,Shutter,https://www.imdb.com/title/tt5119948/?ref_=adv...,2015.0,NaN,NaN,NaN,A tech support man who uses a drone to investi...,False,False,False,False,False,False,False,False,True
20803,20801,The Music Machine,https://www.imdb.com/title/tt5142082/?ref_=adv...,2015.0,NaN,NaN,NaN,A young teenage girl and the ghost of a dead m...,False,False,False,False,False,False,False,False,True
20804,20802,Cryptic,https://www.imdb.com/title/tt10964974/?ref_=ad...,2020.0,NaN,NaN,NaN,Kidnapped by an insane man and dragged into a ...,False,False,False,False,False,False,False,False,True

## 3. Shape and Basic Info about the Dataset

rows, columns

In [5]:
df.shape

(20805, 17)

Shows the categories and weather they have NANs as well as what data type they are.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20805 entries, 0 to 20804
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    20805 non-null  int64
 1   name          20805 non-null  object
 2   url           20805 non-null  object
 3   year          20538 non-null  float64
 4   certificate   7905 non-null   object
 5   rating        11602 non-null  object
 6   votes         11602 non-null  object
 7   plot summary  20805 non-null  object
 8   Action        20805 non-null  bool
 9   Adventure     20805 non-null  bool
 10  Comedy        20805 non-null  bool
 11  Crime         20805 non-null  bool
 12  Family        20805 non-null  bool
 13  Fantasy       20805 non-null  bool
 14  Mystery       20805 non-null  bool
 15  Sci-Fi        20805 non-null  bool
 16  Thriller      20805 non-null  bool
dtypes: bool(9), float64(1), int64(1), object(6)
memory usage: 1.4+ MB

Use describe() to get the statistical values of the data set.

In [7]:
df.describe()

         Unnamed: 0          year
count  20805.000000  20538.000000
mean   10400.066667   2005.567485
std     6005.918897     11.846001
min        0.000000   1952.000000
25%     5199.000000   1997.000000
50%    10400.000000   2008.000000
75%    15601.000000   2016.000000
max    20802.000000   2027.000000

## 4. Look for Duplicates

This is the sum of all the rows that are duplicates in the data set.

In [8]:
df.duplicated().sum()

2

drop_duplicates() takes out the duplicate value, and inplace=True changes the data set to output a 0.

In [9]:
df.drop_duplicates(inplace=True)

In [10]:
df.duplicated().sum()

0

## 5. Fix Types

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20803 entries, 0 to 20804
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    20803 non-null  int64
 1   name          20803 non-null  object
 2   url           20803 non-null  object
 3   year          20536 non-null  float64
 4   certificate   7903 non-null   object
 5   rating        11600 non-null  object
 6   votes         11600 non-null  object
 7   plot summary  20803 non-null  object
 8   Action        20803 non-null  bool
 9   Adventure     20803 non-null  bool
 10  Comedy        20803 non-null  bool
 11  Crime         20803 non-null  bool
 12  Family        20803 non-null  bool
 13  Fantasy       20803 non-null  bool
 14  Mystery       20803 non-null  bool
 15  Sci-Fi        20803 non-null  bool
 16  Thriller      20803 non-null  bool
dtypes: bool(9), float64(1), int64(1), object(6)
memory usage: 1.6+ MB

In [65]:
df.dtypes

name            object
url             object
year           float64
certificate     object
rating         float64
votes           object
summary         object
Action            bool
Adventure         bool
Comedy            bool
Crime             bool
Family            bool
Fantasy           bool
Mystery           bool
Sci-Fi            bool
Thriller          bool
dtype: object

In [62]:
df.rating.value_counts()

7.4    493
7.5    470
7.6    452
7.2    450
7.8    442
      ...
1.5      3
1.3      3
1.0      1
1.4      1
9.0      1
Name: rating, Length: 87, dtype: int64

To get the ratings to be not an object, I replaced the *9.0 error to 9.0.

In [63]:
df.rating.value_counts()
df.rating.replace('*9.0', 9.0, inplace=True)
df.rating.value_counts()

7.4    493
7.5    470
7.6    452
7.2    450
7.8    442
      ...
1.5      3
1.3      3
1.0      1
1.4      1
9.0      1
Name: rating, Length: 87, dtype: int64

Convert into a float.

In [64]:
df.rating = pd.to_numeric(df.rating)

In [16]:
df.columns

Index(['Unnamed: 0', 'name', 'url', 'year', 'certificate', 'rating', 'votes',
       'plot summary', 'Action', 'Adventure', 'Comedy', 'Crime', 'Family',
       'Fantasy', 'Mystery', 'Sci-Fi', 'Thriller'],
      dtype='object')

## 6. Drop and Rename Columns

In [12]:
df.columns

Index(['Unnamed: 0', 'name', 'url', 'year', 'certificate', 'rating', 'votes',
       'plot summary', 'Action', 'Adventure', 'Comedy', 'Crime', 'Family',
       'Fantasy', 'Mystery', 'Sci-Fi', 'Thriller'],
      dtype='object')

To make things easier to find and calculate with more complex problems, it would be easier to keep each index to one word. In this case it would be 'plot summary'. I am going to change it to 'summary'.

In [60]:
df.columns = ['name', 'url', 'year', 'certificate', 'rating', 'votes',
       'summary', 'Action', 'Adventure', 'Comedy', 'Crime', 'Family',
       'Fantasy', 'Mystery', 'Sci-Fi', 'Thriller']
df.columns

Index(['name', 'url', 'year', 'certificate', 'rating', 'votes', 'summary',
       'Action', 'Adventure', 'Comedy', 'Crime', 'Family', 'Fantasy',
       'Mystery', 'Sci-Fi', 'Thriller'],
      dtype='object')

## 7. Fix Nulls

We could replace the nan values, in this case being the year, certificate, rating, and votes, but it would overall skew the data too much to a point where our analysis would be incorrect and bias.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20803 entries, 0 to 20804
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    20803 non-null  int64
 1   name          20803 non-null  object
 2   url           20803 non-null  object
 3   year          20536 non-null  float64
 4   certificate   7903 non-null   object
 5   rating        11600 non-null  object
 6   votes         11600 non-null  object
 7   plot summary  20803 non-null  object
 8   Action        20803 non-null  bool
 9   Adventure     20803 non-null  bool
 10  Comedy        20803 non-null  bool
 11  Crime         20803 non-null  bool
 12  Family        20803 non-null  bool
 13  Fantasy       20803 non-null  bool
 14  Mystery       20803 non-null  bool
 15  Sci-Fi        20803 non-null  bool
 16  Thriller      20803 non-null  bool
dtypes: bool(9), float64(1), int64(1), object(6)
memory usage: 1.6+ MB

In [17]:
df.votes.value_counts()

7        318
9        295
8        294
10       287
12       259
        ...
2,424      1
282        1
1,944      1
728        1
1,402      1
Name: votes, Length: 1905, dtype: int64

In [18]:
df[ (df.rating.isnull()) & (~df.votes.isnull())]

Empty DataFrame
Columns: [Unnamed: 0, name, url, year, certificate, rating, votes, plot summary, Action, Adventure, Comedy, Crime, Family, Fantasy, Mystery, Sci-Fi, Thriller]
Index: []

We could fill votes and ratings with an average, median, or 0, but then we would be giving those video games not enough credit, or too much credit. Then, when we do our calculations, the data will be all messed up and not making sense.

In [19]:
df.votes.fillna(0, inplace=True)

The year is tricky because it seems like too much of an important value to be missing. Putting a 0 doesn't make sense because no video games were even an idea then. The average or median also do not make sense because the years range from 1952-2027. So the best value for this category is NAN.

In [20]:
df[ df.year.isna()]

,Unnamed: 0,name,url,year,certificate,rating,votes,plot summary,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
40,40,Squadron 42,https://www.imdb.com/title/tt5194726/?ref_=adv...,NaN,NaN,NaN,0,Take the role of a rookie UEE Navy combat pilo...,True,False,False,False,False,False,False,True,False
328,328,Off the Grid,https://www.imdb.com/title/tt21419940/?ref_=ad...,NaN,NaN,NaN,0,Add a Plot,True,False,False,False,False,False,False,False,False
371,371,Star Citizen,https://www.imdb.com/title/tt4156346/?ref_=adv...,NaN,NaN,NaN,0,Set in a 30th-century Milky Way centered on th...,True,False,False,False,False,False,False,True,False
454,454,Baldur's Gate III,https://www.imdb.com/title/tt13258344/?ref_=ad...,NaN,NaN,NaN,0,Mindflayer plan to take over the world! They h...,True,True,False,False,False,True,False,False,False
553,553,Wonder Woman,https://www.imdb.com/title/tt16385850/?ref_=ad...,NaN,T,NaN,0,Wonder Woman returns to her mythic home of The...,True,True,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20630,20628,The Shadow Clubs,https://www.imdb.com/title/tt13272864/?ref_=ad...,NaN,NaN,NaN,0,Add a Plot,False,False,False,False,False,False,False,True,False
20647,20645,Descent,https://www.imdb.com/title/tt11967066/?ref_=ad...,NaN,NaN,NaN,0,Add a Plot,False,False,False,False,False,False,False,True,False
20651,20649,Mars Invaders,https://www.imdb.com/title/tt2351684/?ref_=adv...,NaN,NaN,NaN,0,Add a Plot,True,False,False,False,False,False,False,True,False
20757,20755,Apocalyptic Dream,https://www.imdb.com/title/tt12844590/?ref_=ad...,NaN,NaN,NaN,0,Add a Plot,False,False,False,False,False,False,False,False,True
20771,20769,Wayholm,https://www.imdb.com/title/tt4986846/?ref_=adv...,NaN,NaN,NaN,0,"It's arcade style survival game, taking place ...",False,False,False,False,False,False,False,False,True

## 8. Summarize Categorical Columns

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20803 entries, 0 to 20804
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          20803 non-null  object
 1   url           20803 non-null  object
 2   year          20536 non-null  float64
 3   certificate   7903 non-null   object
 4   rating        11600 non-null  object
 5   votes         20803 non-null  object
 6   plot summary  20803 non-null  object
 7   Action        20803 non-null  bool
 8   Adventure     20803 non-null  bool
 9   Comedy        20803 non-null  bool
 10  Crime         20803 non-null  bool
 11  Family        20803 non-null  bool
 12  Fantasy       20803 non-null  bool
 13  Mystery       20803 non-null  bool
 14  Sci-Fi        20803 non-null  bool
 15  Thriller      20803 non-null  bool
dtypes: bool(9), float64(1), object(6)
memory usage: 1.4+ MB

These explain how many times each value comes up in the data set.

In [36]:
df.name.value_counts()

Spider-Man                                  9
God of War                                  6
Sonic the Hedgehog                          6
Star Trek                                   6
Batman                                      5
                                           ..
Hokuto no Ken: Violence Gekiga Adventure    1
Tasogare Quest                              1
Mazinger Z                                  1
Monster Prom                                1
Magical Cat Adventure                       1
Name: name, Length: 19714, dtype: int64

In [37]:
df.certificate.value_counts()

T            2474
E            2006
M            1820
E10+          814
Unrated       241
K-A           227
Not Rated     184
AO             32
GA             26
EC             25
CE             13
12              9
MA-13           7
PG-13           7
Approved        4
G               4
PG              3
MA-17           3
TV-MA           2
Passed          1
TV-14           1
Name: certificate, dtype: int64

## 9. Summarize Numeric Columns

describe() lists all of the statistical data for the floats and ints.

In [68]:
df.describe()

               year        rating
count  20536.000000  11600.000000
mean    2005.568611      7.047526
std       11.846028      1.235204
min     1952.000000      1.000000
25%     1997.000000      6.400000
50%     2008.000000      7.200000
75%     2016.000000      7.900000
max     2027.000000      9.700000

I think that there is a way to get the votes to be non objects, but I cannot figure it out.

In [47]:
df.votes.value_counts()

0         9203
7          318
9          295
8          294
10         287
          ...
568          1
4,703        1
2,139        1
15,706       1
1,369        1
Name: votes, Length: 1906, dtype: int64

In [56]:
df.rating.value_counts()

7.4    493
7.5    470
7.6    452
7.2    450
7.8    442
      ...
1.5      3
1.3      3
1.0      1
1.4      1
9.0      1
Name: rating, Length: 87, dtype: int64